

org 0h
lxi sp,0300h
; Адреса регистров ВВ55 в общем с памятью адр. простр-ве кА-8000h, кВ-8001h, кС-8002h, РУС-8003h 
; управление сегментами от кВ и кС (C3-C0), позицией от кА 

;прогрммируем ВВ55,адреса кан.А = 8000h, B = 8001h, C = 8002h, RUS = 8003h
; слово режима УС1 = 80h (режим 0), все порты на вывод
mvi a,80h
sta 8003h
;программирование ВВ51
;Regcom=c001h, RegData=c000h,  асинхронный режим
const Reset 40h
const word2 0fdh  ; слово режима
const com 05h   ; слово команды - разрешена работа приемника 
;и передатчика
const zond 0eeh  ;зонд
const  MASKresiver 02h  ;маска для выделения признака готовности 
const  MASK 01h  ;
;данных в приемнике
;mvi a,Reset
;sta 0c001h ;программный сброс ВВ51
mvi a,word2 ; слово режима
sta 0c001h ;
mvi a,com ;слово команды
sta 0c001h ;
;Проверка состояния 1-й машины ожиданием передачи данных от неё
:y1
lda 0c001h ; читаем регистр состояния ВВ51
ani MASKresiver ;выделяем значение разряда готовности данных 
;в своём приемнике
jz y1 ;если 0, данных нет, ждем передачи
;приемник получил от 1-й машины Zond, 1-я машина работает, отсылаем 
;его в качестве Эхо-как 
;свидетельство своей готовности к совместной работе
lda 0c000h  ;читаем зонд
sta 0c000h ; отослали в свой передатчик, 1-я машина поймет,
; что 2-я работает и можно передавать данные

; прием данных и формирование строки для вывода на индикатор

const END 0ffh  ;признак конца строки символов (договорились 
;с 1-й машиной так заканчивать передачу данных)

Lxi h,lab2 ;

:y2

lda 0c001h ; читаем регистр состояния ВВ51
ani MASKresiver ;выделяем значение разряда готовности данных 
;в приемнике
jz y2 ;если 0, данных нет, ждем
;приемник получил от 1-й машины  n-й символ
lda 0c000h  ;читаем символ
cpi END  ;
jz y3 ;если 0 прием закончен и надо отображать фразу

mov m,a
inx h
jmp y2
 ; в HL паре сформирован адрес, где находится код END, но этот 
;код в память не записывается
 

:y3 
mvi a,80h
sta 8002h  ;включим индикатор конца передачи данных
 


lxi h,stroka1
mvi c,01h  ; регистр С -счетчик символов
mov a,c
:m33
cpi N
jz f22
lda 0c001h ; читаем регистр состояния ВВ51
ani MASK ;выделяем значение разряда готовности данных 
;в приемнике
jz m33 ;
;ждем прерывание от передатчика
:data   ; ПП записи в передатчик элем-в строки
mov a,m
cpi END;
jz f21;
sta 0c000h ;
;out 00h 
inx h
inr c
mov a,c
jmp m33

:f21
sta 0c009h;
:f22

;Отображение принятых символов

const finish 80h ;поледняя позиция индикатора
;пусть регистровая пара B  процессора отвечает за текущую позицию символа, 
;PP2- выдержка длительности отбражения символа и гашения индикатора,
; lab1 -адрес 1-го символа массива 

; N - количество 2-х байтовых символов в строке
const N 1dh
lxi b,8000h
:m6
mvi a,00h
mvi e,01h
stax b ; гасим индикатор
lxi h,lab1 ; читаем адрес 1-го символа в строке

:m2 ;начало отображения
lxi sp,0300h ;установка вершины стека
push h ; сохраняем  адрес символа,который будет отображен в 1-й позиции 
;индикатора в стеке
mvi a,01h ;задаем позицию отображения 1-го символа
sphl ; адрес символа в SP- меняем значение указателя для адресации 
;символов строки 
:m
pop h    ;  в HL - код символа
shld 8001h ;загружаем код символа в канал В и С  
stax b ;установка позиции - зажгли букву
mov d,a ; сохраняем текущую позицию в регистре D, т.к. аккумулятором 
;еще будем пользоваться
jmp pp2  ;выдержка времени отображения символа и гашение индикатора, 
;по окончании к метке m3
:m3 
mov a,d ;восстанавливаем значение текущей позиции отображенного 
;символа для сравнения с мах-finish
cpi finish
jz m5 ;если 0 надо сдвинуть указатель адреса символа на следующий 
;символ и продолжить 
;их вывод на индикатор с 1-й позиции
rlc ;сдвиг - новая позиция
mov d,a ; сохраняем новое значение позиции в D
jmp m ;крутимся для отображения всех 8-ми символов
:m5
lxi sp,02feh ;загружаем в SP адрес, где хранится адрес предыдущего 
;символа для отображения в 1-й позиции
pop h ;в HL - адрес предыдущего символа 
inx h
inx h ; указали адрес следующего символа для отбражения в 1-й позиции и
; надо его загрузить в SP
inr e
mov a,e ; номер текущего символа
cpi N
jz m6

jmp m2 

:pp2

mvi a,0h
stax b ;гашение индикатора
jmp m3
;по окончании приема в памяти с адреса lab2 будет сформирован массив 
;из какого-то числа байт.
;для вывода в режиме бегущая строка первые 7 2-х байтовых 
;слов д.б. нулями
lab1 dr 14 ;резервирум 14 ячеек памяти под нули
lab2 dr 30 ;резервирум 30 ячеек памяти под фразу
lab3 dr 14 ; под нули в конце фразы

:stroka1
db 54h, 69h, 6bh, 68h, 6fh, 6eh, 6fh, 76h, 0ffh ; Tikhonov
