; Адреса регистров ВВ55 в общем с памятью адр. простр-ве кА-8000h, кВ-8001h, кС-8002h, РУС-8003h 
; управление сегментами от кВ и кС, позицией от кА 
org 0h
; инициализация ВВ55
lxi h,8003h ;адрес РУС
mvi m,080h ; все каналы на вывод в реж.0
const finish 80h ;поледняя позиция индикатора
;пусть регистровая пара B  процессора отвечает за текущую позицию символа, 
;PP2- выдержка длительности отбражения символа и гашения индикатора,
; lab -адрес 1-го символа строки, N - количество символов в строке
const N 016h
lxi b,8000h
:m6
mvi a,00h
mvi e,01h
stax b ; гасим индикатор
lxi h,lab ; читаем адрес 1-го символа в строке
:m2 ;начало отображения
lxi sp,0300h ;установка вершины стека
push h ; сохраняем  адрес символа,который будет отображен в 1-й позиции индикатора в стеке
mvi a,01h ;задаем позицию отображения 1-го символа
sphl ; адрес символа в SP- меняем значение указателя для адресации символов строки 
:m
pop h    ;  в HL - код символа
shld 8001h ;загружаем код символа в канал В и С  
stax b ;установка позиции - зажгли букву
mov d,a ; сохраняем текущую позицию в регистре D, т.к. аккумулятором еще будем пользоваться
jmp pp2  ;выдержка времени отображения символа и гашение индикатора, по окончании к метке m3
:m3 
mov a,d ;восстанавливаем значение текущей позиции отображенного символа для сравнения с мах-finish
cpi finish
jz m5 ;если 0 надо сдвинуть указатель адреса символа на следующий символ и продолжить 
;их вывод на индикатор с 1-й позиции
rlc ;сдвиг - новая позиция
mov d,a ; сохраняем новое значение позиции в D
jmp m ;крутимся для отображения всех 8-ми символов
:m5
lxi sp,02feh ;загружаем в SP адрес, где хранится адрес предыдущего символа для отображения в 1-й позиции
pop h ;в HL - адрес предыдущего символа 
inx h
inx h ; указали адрес следующего символа для отбражения в 1-й позиции и надо его загрузить в SP
inr e
mov a,e ; номер текущего символа
cpi N
jz m6

jmp m2 
; Строка символов для отображения
:lab
dw dw 0h,0h,0h,0h,0h,0h,0h,0436h,0031h,076h,0156h,0930h,03Fh,027Ch,0h,0106h,006Fh,040h,027Ch,040h,040Bh,0h,0h,0h,0h,0h,0h,0h; Игнаков 19-В-2
:pp2
mvi a,02h
:m1
dcr a
cpi 00h
jnz m1
mvi a,0h
stax b
jmp m3